ubparot/AQUAScan/Firmware/ESP32/AQUAScanESP32/AQUAScanESP32.ino
    values[i] = static_cast<int>(parsed);

    if (i == expectedCount - 1)
      return *endPointer == '\0';

    if (*endPointer != ',')
      return false;

    cursor = endPointer + 1;
  }

  return true;
}

int clampPulse(int value)
{
  if (value < kMinMicros)
    return kMinMicros;
  if (value > kMaxMicros)
    return kMaxMicros;
  return value;
}

String socketPayloadToString(const char* payload, size_t length)
{
  String message;
  message.reserve(length + 1);
  for (size_t i = 0; i < length; i++)
    message += payload[i];
  return message;
}

String readJsonString(const String& message, const char* key, const String& fallback)
{
  int index = findJsonValueStart(message, key);
  if (index < 0 || index >= static_cast<int>(message.length()) || message[index] != '"')
    return fallback;

  index++;
  String value;
  while (index < static_cast<int>(message.length()))
  {
    const char current = message[index++];
    if (current == '"')
      return value;
    if (current == '\\' && index < static_cast<int>(message.length()))
      value += message[index++];
    else
      value += current;
  }

  return fallback;
}

bool readJsonBool(const String& message, const char* key, bool fallback)
{
  const int index = findJsonValueStart(message, key);
  if (index < 0)
    return fallback;

  if (message.startsWith("true", index))
    return true;
  if (message.startsWith("false", index))
    return false;
  return fallback;
}

int readJsonInt(const String& message, const char* key, int fallback)
{
  const int index = findJsonValueStart(message, key);
  if (index < 0)
    return fallback;

  char* endPointer = nullptr;
  const char* start = message.c_str() + index;
  const long parsed = strtol(start, &endPointer, 10);
  if (endPointer == start)
    return fallback;

  return static_cast<int>(parsed);
}

float readJsonFloat(const String& message, const char* key, float fallback)
{
  const int index = findJsonValueStart(message, key);
  if (index < 0)
    return fallback;

  char* endPointer = nullptr;
  const char* start = message.c_str() + index;
  const float parsed = strtof(start, &endPointer);
  if (endPointer == start)
    return fallback;

  return parsed;
}

int findJsonValueStart(const String& message, const char* key)
{
  String pattern = "\"";
  pattern += key;
  pattern += "\"";

  int index = message.indexOf(pattern);
  if (index < 0)
    return -1;

  index = message.indexOf(':', index + pattern.length());
  if (index < 0)
    return -1;

  index++;
  while (index < static_cast<int>(message.length()) && isspace(static_cast<unsigned char>(message[index])))
    index++;

  return index;
}

String escapeJson(const String& value)
{
  String escaped;
  escaped.reserve(value.length());
  for (int i = 0; i < static_cast<int>(value.length()); i++)
  {
    const char current = value[i];
    if (current == '"' || current == '\\')
      escaped += '\\';
    escaped += current;
  }
  return escaped;
}

void appendJsonNumber(String& json, const char* key, double value, int decimals)
{
  json += F(",\"");
  json += key;
  json += F("\":");
  json += String(value, decimals);
}

void startNetwork()
{
  WiFi.persistent(false);
  WiFi.setSleep(false);

  if (!connectToRouter())
    startFallbackAccessPoint();
}

bool connectToRouter()
{
  if (String(kStaSsid) == "YOUR_ROUTER_SSID" || String(kStaPassword) == "YOUR_ROUTER_PASSWORD" || strlen(kStaSsid) == 0)
  {
    Serial.println(F("Router credentials not configured. Starting fallback AP."));
    return false;
  }

  WiFi.mode(WIFI_STA);
  WiFi.begin(kStaSsid, kStaPassword);

  Serial.printf("Connecting to router SSID '%s'", kStaSsid);
  const unsigned long startedAt = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - startedAt < kStaConnectTimeoutMs)
  {
    delay(250);
    Serial.print('.');
  }
  Serial.println();

  if (WiFi.status() != WL_CONNECTED)
  {
    Serial.println(F("Router connection failed."));
    WiFi.disconnect(true, true);
    return false;
  }

  Serial.print(F("Router connected. ESP32 IP: "));
  Serial.println(WiFi.localIP());
  return true;
}

void startFallbackAccessPoint()
{
  WiFi.mode(WIFI_AP);
  WiFi.softAP(kApSsid, kApPassword);
  Serial.print(F("Fallback AP started. SSID: "));
  Serial.println(kApSsid);
  Serial.print(F("Fallback AP IP: "));
  Serial.println(WiFi.softAPIP());
}
